-- MySQL dump 10.13  Distrib 8.0.29, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: deliver
-- ------------------------------------------------------
-- Server version	8.0.29

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `menu`
--

DROP TABLE IF EXISTS `menu`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `menu` (
  `name` varchar(20) NOT NULL,
  `dishes` varchar(999) DEFAULT NULL,
  `price` varchar(999) DEFAULT NULL,
  PRIMARY KEY (`name`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `menu`
--

LOCK TABLES `menu` WRITE;
/*!40000 ALTER TABLE `menu` DISABLE KEYS */;
INSERT INTO `menu` VALUES ('GABA 元気の源！嘎吧！','[\"和風鮪魚\", \"北海道鮭魚\", \"茶香牛蒡\", \"瀨戶內海鹽\", \"開胃乾梅\", \"醬汁柴魚\", \"高纖菇菇\", \"照燒雞\"]','[\"50\", \"60\", \"45\", \"35\", \"45\", \"50\", \"55\", \"60\"]'),('juice-detour','[\"yellow warrior\", \"on fire活力火\", \"hit girl超殺女\", \"bloody hell我的老天爺\", \"spectacular green神奇小綠人\", \"gentle green紳士綠\", \"absolutely green絕對綠\"]','[\"95\", \"95\", \"95\", \"95\", \"95\", \"95\", \"95\"]'),('Miss Energy 低GI廚房 台北','[\"水煮嫩雞胸(437cal)\", \"蒜泥豬里肌(472cal)\", \"韓式菇菇雞(457cal)\", \"香滷雞腿(572cal)\", \"泡菜豬里肌(468cal)\", \"鹽烤鯖魚(539cal)\", \"清滷牛腱(480cal)\"]','[\"110\", \"110\", \"120\", \"110\", \"120\", \"120\", \"165\"]'),('UFO車輪餅','[\"奶油布蕾\", \"蘿蔔絲\", \"雙拼(紅豆+奶油)\", \"巧克力\", \"紅豆\", \"芋頭\", \"紅豆麻糬\", \"起司玉米\", \"起司火腿\"]','[\"15\", \"15\", \"15\", \"15\", \"15\", \"15\", \"15\", \"15\", \"15\"]'),('Uncle L2 手作舒芙蕾甜點店','[\"經典原味\", \"苦甜巧克力\", \"抹茶紅豆\", \"焦糖伯爵卡士達\"]','[\"90\", \"100\", \"100\", \"120\"]'),('億圓花炮煙火公司','[\"魯肉飯\", \"叉燒飯\", \"雞排飯\"]','[\"40\", \"60\", \"70\"]'),('古早味涼麵&雞魯飯','[\"涼麵\", \"雞魯飯\", \"涼麵套餐\", \"雞魯飯套餐\", \"味增湯\", \"味增貢丸湯\", \"紅茶\", \"綠茶\"]','[\"50\", \"50\", \"60\", \"60\", \"20\", \"30\", \"20\", \"20\"]'),('台灣大咖哩(雙城)','[\"日式咖哩雞飯\", \"印度咖哩雞飯\", \"控肉蓋飯\", \"紅燒牛腩飯\", \"雞肉丼飯\", \"香菇雞湯\"]','[\"80\", \"80\", \"80\", \"80\", \"80\", \"40\"]'),('台灣第一味(台北松山店)','[\"當代雙Q\", \"冷泡綠茶\", \"黑糖鮮奶珍珠\", \"甘蔗青了\", \"招牌高山青\", \"紫芋西米露\"]','[\"50\", \"35\", \"65\", \"55\", \"25\", \"55\"]'),('壹森泰食堂','[\"泰式雞腿便當\", \"霜降豬肉片便當\", \"香茅豬排便當\", \"椰子咖哩雞便當(微辣)\", \"泰北打拋豬便當(小辣)\", \"泰醬烤魚\"]','[\"110\", \"110\", \"100\", \"100\", \"100\", \"120\"]'),('大安站那邊','[\"五花肉佐糯米椒飯\", \"宮保辣雞丁飯\", \"九層打拋豬飯\", \"佐宗棠雞飯\", \"糖醋里肌飯\", \"蒜泥白肉飯\", \"鐵板牛柳飯\", \"青椒牛肉飯\"]','[\"120\", \"120\", \"120\", \"120\", \"120\", \"120\", \"150\", \"150\"]'),('廣大順','[\"原味肉乾\", \"黑胡椒肉乾\", \"原味肉紙\", \"黑胡椒肉紙\", \"肉條\", \"牛肉乾\", \"魷魚絲\", \"魷魚網\"]','[\"200\", \"200\", \"270\", \"270\", \"220\", \"300\", \"280\", \"280\"]'),('春來麵線','[\"綜合麵線\", \"大腸麵線\", \"蚵仔麵線\", \"清麵線\", \"魚丸湯\", \"貢丸湯\", \"魚貢綜合湯\", \"碗粿\", \"南部肉粽\", \"蘿蔔\", \"滷豆腐\"]','[\"70\", \"70\", \"70\", \"45\", \"30\", \"30\", \"30\", \"40\", \"60\", \"30\", \"25\"]'),('東湖頂尖排骨大王','[\"雞腿飯\", \"排骨飯\", \"焢肉飯\", \"日式豬排飯\", \"鱈魚排飯\", \"蝦仁捲飯\", \"香檸雞柳飯\", \"菜飯便當\", \"雞腿\", \"排骨\"]','[\"110\", \"100\", \"100\", \"100\", \"90\", \"90\", \"90\", \"70\", \"60\", \"50\"]'),('樸食','[\"宮保雞丁\", \"香煎雞腿\", \"梅花豬\", \"挪威鯖魚\"]','[\"100\", \"100\", \"100\", \"100\"]'),('湯圓妹現烤甜甜圈 八德店','[\"原味\", \"巧克力\", \"起司\", \"草莓\", \"黑糖\", \"奶酥\", \"棉花糖\", \"肉桂\", \"煉乳\", \"香蒜\", \"香濃花生\"]','[\"35\", \"35\", \"35\", \"35\", \"35\", \"35\", \"40\", \"40\", \"40\", \"40\", \"45\"]'),('煲柏思維','[\"蛋炒飯套餐\", \"牛肉蛋炒飯套餐\", \"豬肉蛋炒飯套餐\", \"炒青菜\"]','[\"40\", \"40\", \"40\", \"60\"]'),('珍蜜便當2020更新','[\"蔥油雞飯\", \"炸雞腿飯\", \"炸大排骨飯\", \"小排香腸飯\", \"扣肉香腸飯\", \"火腿蛋炒飯\", \"炸蝦飯\", \"香腸飯\", \"海鮮飯\"]','[\"140\", \"120\", \"120\", \"120\", \"120\", \"110\", \"120\", \"100\", \"120\"]'),('盛味豐炭烤燒餅','[\"炭烤燒餅(原味)\", \"芝麻糖餅(甜)\", \"豆沙酥餅(甜)\", \"蔥酥餅(鹹)\", \"豆漿(有焦味那種)\"]','[\"20\", \"15\", \"15\", \"15\", \"20\"]'),('真味肉圓 (台北新明店)','[\"肉粽\", \"清蒸肉圓\", \"豬腸四神湯\", \"豬肚四神湯\", \"綜合四神湯\", \"四神湯\"]','[\"50\", \"40\", \"50\", \"60\", \"60\", \"40\"]'),('緯大雞排（內湖店）Gver.','[\"香酥雞排\", \"香酥嫩雞柳\", \"無骨雞腿\", \"3號餐:雞排(柳)/原萃日式綠茶\", \"4號餐:雞排(柳)/可樂\"]','[\"70\", \"70\", \"70\", \"95\", \"95\"]'),('老蔡水煎包-復興店','[\"鮮肉水煎包\", \"高麗菜水煎包\", \"韭菜水煎包\"]','[\"16\", \"16\", \"16\"]'),('腿庫*豬腳便當','[\"醬爆肉絲便當\", \"炸蝦捲便當\", \"辣子雞便當\", \"滷雞腿便當\", \"炸雞腿便當\", \"滷豬排便當\", \"炸豬排便當\", \"魚排便當\", \"香腸便當\", \"豬腳便當\", \"腿庫便當\"]','[\"90\", \"90\", \"90\", \"95\", \"95\", \"90\", \"90\", \"90\", \"80\", \"90\", \"90\"]'),('萊客潤餅捲(內湖)','[\"原味\", \"咖哩\", \"芥末\", \"辣粉\", \"無糖花生\", \"起司\", \"海苔\"]','[\"45\", \"55\", \"55\", \"55\", \"45\", \"55\", \"55\"]'),('邱太太','[\"紅豆湯芝麻湯圓\", \"花生湯芝麻湯圓\", \"紅豆花生湯芝麻湯圓\", \"甜湯芝麻湯圓\", \"紅豆湯小湯圓\", \"花生湯小湯圓\", \"紅豆花生湯小湯圓\", \"甜湯小湯圓\"]','[\"75\", \"85\", \"85\", \"65\", \"50\", \"60\", \"60\", \"50\"]'),('阿琴自助餐','[\"海鮮粥\", \"肉絲炒麵\", \"蝦仁炒麵\", \"海鮮麵\", \"肉絲炒飯\", \"蝦仁炒飯\", \"蝦捲飯\", \"香腸飯\", \"控肉販\", \"排骨飯\", \"魚便當\", \"雞腿飯\"]','[\"80\", \"80\", \"80\", \"80\", \"80\", \"80\", \"85\", \"85\", \"90\", \"90\", \"100\", \"100\"]'),('雞の專家_劍潭','[\"雞排\", \"雞翅\", \"無骨雞塊(限量)\", \"薯條\"]','[\"70\", \"30\", \"70\", \"40\"]'),('鴨寶精緻便當','[\"排骨飯\", \"爌肉飯\", \"糖醋里肌飯\", \"牛柳飯\", \"雞腿飯\"]','[\"80\", \"80\", \"80\", \"90\", \"90\"]'),('龍記燒臘-南港店','[\"燒鴨飯\", \"三寶飯\", \"黯然消魂飯\", \"蒜香排骨飯\", \"油雞飯\"]','[\"100\", \"100\", \"100\", \"90\", \"90\"]');
/*!40000 ALTER TABLE `menu` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2022-06-13 13:48:21
